app/controllers/api/v1/empresas_controller.rb

    def index
        @empresa = Empresa.all
---
SELECT "empresas".* FROM "empresas"

    def show
        @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        def set_empresa
            @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]